Revit 2024 API
DuctSettings.GetPressLossCalculationServerInfo Method
 Get the MEPServerInfo of the current pipe pressure loss calculation server.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public MEPCalculationServerInfo GetPressLossCalculationServerInfo()
Visual Basic
Public Function GetPressLossCalculationServerInfo As MEPCalculationServerInfo
Visual C++
public:
MEPCalculationServerInfo^ GetPressLossCalculationServerInfo()
Return Value
 The MEPServerInfo of the current pipe pressure loss calculation server
See Also
DuctSettings Class
Autodesk.Revit.DB.Mechanical Namespace